class SurveyQestion {
  final String question;
  final List<String> answers;

  SurveyQestion({
    this.question,
    this.answers,
  });

  static List<SurveyQestion> getSurveys() {
    return [
      SurveyQestion(
        question: 'รู้สึกสบายและมีสุขภาพดี',
        answers: ['ก. ดีกว่าปกติ', 'ข. เหมือนปกติ', 'ค. แย่กว่าปกติ', 'ง. แย่กว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกต้องการยาบำรุงให้มีกำลังวังชา',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกทรุดโทรมและสุขภาพไม่ดี',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกไม่สบาย',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'เจ็บหรือปวดศีรษะ',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกตึงหรือคล้ายมีแรงกดที่ศีรษะ',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'มีอาการร้อนวูบวาบหรือหนาว',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'นอนไม่หลับเพราะกังวลใจ',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'ไม่สามารถหลับได้สนิทหลังจากหลับแล้ว',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกตึงเครียดอยู่ตลอดเวลา',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกหงุดหงิด อารมณ์ไม่ดี ',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกกลัวหรือตกใจโดยไม่มีเหตุผลสมควร',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกเรื่องต่าง ๆ ทับถมจนรับไม่ไหว',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกกังวล กระวนกระวาย และเครียดอยู่ตลอดเวลา',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'หาอะไรทำให้ตัวเองไม่มีเวลาว่างได้',
        answers: ['ก. มากกว่าปกติ', 'ข. เหมือนปกติ', 'ค. น้อยกว่าปกติ', 'ง.น้อยกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'ทำอะไรช้ากว่าปกติ ',
        answers: ['ก. เร็วกว่าปกติ', 'ข. เหมือนปกติ', 'ค. ช้ากว่าปกติ', 'ง. ช้ากว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกว่าโดยทั่วไปแล้วทำอะไร ๆ ได้ดี',
        answers: ['ก. ดีกว่าปกติ', 'ข. เหมือนปกติ', 'ค. น้อยกว่าปกติ', 'ง. น้อยกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'พอใจกับการที่ทำงานลุล่วงไป',
        answers: ['ก. มากกว่าปกติ', 'ข. เหมือนปกติ', 'ค. น้อยกว่าปกติ', 'ง. น้อยกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกว่าได้ทำตัวให้เป็นประโยชน์ในเรื่องต่าง ๆ',
        answers: ['ก. มากกว่าปกติ', 'ข. เหมือนปกติ', 'ค. น้อยกว่าปกติ', 'ง. น้อยกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกว่าสามารถตัดสินใจในเรื่องต่าง ๆ ได้',
        answers: ['ก. มากกว่าปกติ', 'ข. เหมือนปกติ', 'ค. น้อยกว่าปกติ', 'ง. น้อยกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'สามารถมีความสุขกับกิจกรรมในชีวิตประจำวันตามปกติได้',
        answers: ['ก. มากกว่าปกติ', 'ข. เหมือนปกติ', 'ค. น้อยกว่าปกติ', 'ง. น้อยกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'คิดว่าตัวเองเป็นคนไร้ค่า ',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกว่าชีวิตนี้หมดหวังโดยสิ้นเชิง',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'รู้สึกไม่คุ้มค่าที่จะมีชีวิตอยู่ต่อไป',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'คิดว่ามีความเป็นไปได้ที่จะอยากจบชีวิตตัวเอง',
        answers: ['ก. ไม่อย่างแน่นอน', 'ข. ไม่คิดว่าเป็นอย่างนั้น', 'ค. มีอยู่บ้างเหมือนกัน', 'ง. มีแน่ ๆ'],
      ),
      SurveyQestion(
        question: 'รู้สึกว่าบางครั้งทำอะไรไม่ได้เลยเพราะประสาทตึงเครียดมาก',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'พบว่าตัวเองรู้สึกอยากตายไปให้พ้น ๆ',
        answers: ['ก. ไม่เลย', 'ข. ไม่มากกว่าปกติ', 'ค. ค่อนข้างมากกว่าปกติ', 'ง. มากกว่าปกติมาก'],
      ),
      SurveyQestion(
        question: 'พบว่ามีความรู้สึกที่อยากจะทำลายชีวิตตัวเองเข้ามาอยู่ในความคิดเสมอ ๆ',
        answers: ['ก. ไม่อย่างแน่นอน', 'ข. ไม่คิดว่าเป็นอย่างนั้น', 'ค. มีอยู่บ้างเหมือนกัน', 'ง. มีแน่ ๆ'],
      ),
    ];
  }
}
